Revit 2027 API
BuiltInFailures.ComponentRepeaterSlotFailures Class
 Failures related to component repeater slots.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterSlotFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ComponentRepeaterSlotFailures
Public NotInheritable Class ComponentRepeaterSlotFailures
public ref class ComponentRepeaterSlotFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ComponentRepeaterSlotFailures = class end
The BuiltInFailures.ComponentRepeaterSlotFailures type exposes the following members.
Properties
Name | Description
ComponentRepeaterSlot_InvalidFamilyOnReload |  Reloaded family not appropriate for repeated component.
Top
See Also
Reference
Autodesk.Revit.DB Namespace